# RebarShapeEndtreatmentStartType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarShapeEndtreatmentStartType Property
ParameterTypeId Class See Also
---
"End Treatment At Start"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarShapeEndtreatmentStartType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarShapeEndtreatmentStartType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarShapeEndtreatmentStartType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace